# IMDb Dataset Details
Each dataset is contained in a gzipped, tab-separated-values (TSV) formatted file in the UTF-8 character set. The first line in each file contains headers that describe what is in each column. A ‘\N’ is used to denote that a particular field is missing or null for that title/name. The available datasets are as follows:

-title.akas.tsv.gz<br> 
 - titleId (string) - a tconst, an alphanumeric unique identifier of the title
 - ordering (integer) – a number to uniquely identify rows for a given titleId
 -title (string) – the localized title
 -region (string) - the region for this version of the title
 -language (string) - the language of the title
 -types (array) - Enumerated set of attributes for thisalternative title. One or more of the following: "alternative", "dvd", "festival", "tv", "video", "working", "original", "imdbDisplay". New values may be added in the future without warning
 -attributes (array) - Additional terms to describe this alternative title, not enumerated
 -isOriginalTitle (boolean) – 0: not original title; 1: original titletitle.basics.tsv.gz

-title.basics.tsv.gz<br>
 - tconst (string) - alphanumeric unique identifier of the title
 - titleType (string) – the type/format of the title (e.g. movie, short, tvseries, tvepisode, video, etc)
 - primaryTitle (string) – the more popular title / the title used by the filmmakers on promotional materials at the point of release
 - originalTitle (string) - original title, in the original language
 - isAdult (boolean) - 0: non-adult title; 1: adult title
 - startYear (YYYY) – represents the release year of a title. In the case of TV Series, it is the series start year
 - endYear (YYYY) – TV Series end year. ‘\N’ for all other title types
 - runtimeMinutes – primary runtime of the title, in minutes
 - genres (string array) – includes up to three genres associated with the title
-title.crew.tsv.gz
 - tconst (string) - alphanumeric unique identifier of the title
 - directors (array of nconsts) - director(s) of the given title
 - writers (array of nconsts) – writer(s) of the given title

-title.ratings.tsv.gz
 - tconst (string) - alphanumeric unique identifier of the title
 - averageRating – weighted average of all the individual user ratings
 - numVotes - number of votes the title has received

In [39]:
basics_url = 'https://datasets.imdbws.com/title.basics.tsv.gz'
ratings_url = 'https://datasets.imdbws.com/title.ratings.tsv.gz'
akas_url = 'https://datasets.imdbws.com/title.akas.tsv.gz'

# Imports

In [69]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

## Load Data

In [41]:
basics_df = pd.read_csv(basics_url, sep='\t', low_memory=False)

In [42]:
basics_df.head(5)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [43]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9971219 entries, 0 to 9971218
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 684.7+ MB

In [45]:
ratings_df = pd.read_csv(ratings_url, sep='\t', low_memory=False)

In [46]:
ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000003            6.5      1839
3  tt0000004            5.5       178
4  tt0000005            6.2      2624

In [47]:
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1325581 entries, 0 to 1325580
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1325581 non-null  object
 1   averageRating  1325581 non-null  float64
 2   numVotes       1325581 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 30.3+ MB

In [49]:
akas_df = pd.read_csv(akas_url, sep='\t', low_memory=False)

In [50]:
akas_df.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
3,tt0000001,4,Καρμενσίτα,GR,\N,imdbDisplay,\N,0
4,tt0000001,5,Карменсита,RU,\N,imdbDisplay,\N,0

In [51]:
akas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36415769 entries, 0 to 36415768
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  object
dtypes: int64(1), object(7)
memory usage: 2.2+ GB

## Clean Data

### Basics

#### Replace N with NaN

In [52]:
basics_df = basics_df.replace({'\\N':np.nan})

In [83]:
basics_df[basics_df.eq('\\N').any(1)]

Empty DataFrame
Columns: [tconst, titleType, primaryTitle, originalTitle, isAdult, startYear, endYear, runtimeMinutes, genres]
Index: []

In [84]:
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34803,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
42384,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History"
61115,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
67667,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
86799,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

#### Eliminate movies that are null for runtimeMinutes

In [85]:
basics_df.dropna(subset=['runtimeMinutes'], inplace=True)

In [86]:
basics_df['runtimeMinutes'].isna().sum()

0

#### Eliminate movies that are null for genre

In [87]:
basics_df['genres'].isna().sum()

0

In [88]:
basics_df.dropna(subset=['genres'], inplace=True)

In [89]:
basics_df['genres'].isna().sum()

0

#### Keep only 'titleType' is Movie

In [90]:
basics_df['titleType'].unique()

array(['movie'], dtype=object)

In [62]:
is_movie = basics_df['titleType'] == 'movie'
basics_df = basics_df[is_movie]
basics_df['titleType'].unique()

array(['movie'], dtype=object)

In [91]:
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34803,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
42384,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History"
61115,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
67667,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
86799,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

#### Keep only movies with startYear 2000 to 2021

In [92]:
basics_df['startYear'].info()

<class 'pandas.core.series.Series'>
Int64Index: 138096 entries, 34803 to 9971069
Series name: startYear
Non-Null Count   Dtype
--------------   -----
138096 non-null  float64
dtypes: float64(1)
memory usage: 2.1 MB

In [93]:
basics_df['startYear'] = basics_df['startYear'].astype('float')

In [94]:
yrange = (basics_df['startYear'] >= 2000) & (basics_df['startYear'] <=2021)
basics_df = basics_df[yrange]
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34803,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
42384,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History"
61115,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
67667,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
86799,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

#### Eliminate movies that included Documentary in the genres column

In [95]:
# Exclude movies that are included in the documentary category.
is_documentary = basics_df['genres'].str.contains('documentary',case=False)
basics_df = basics_df[~is_documentary]

In [96]:
basics_df[is_documentary]

Empty DataFrame
Columns: [tconst, titleType, primaryTitle, originalTitle, isAdult, startYear, endYear, runtimeMinutes, genres]
Index: []

### AKAs

In [97]:
akas_df.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0
3,tt0000001,4,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0
4,tt0000001,5,Карменсита,RU,NaN,imdbDisplay,NaN,0

#### Replace N with NaN

In [108]:
akas_df.replace({'\\N':np.nan}, inplace=True)

In [109]:
akas_df.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0
3,tt0000001,4,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0
4,tt0000001,5,Карменсита,RU,NaN,imdbDisplay,NaN,0

#### Keep US movies only

In [117]:
us_movies= akas_df['region'] == 'US'

In [118]:
akas_df = akas_df[us_movies]
akas_df

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0
...,...,...,...,...,...,...,...,...
36415295,tt9916560,1,March of Dimes Presents: Once Upon a Dime,US,NaN,imdbDisplay,NaN,0
36415365,tt9916620,1,The Copeland Case,US,NaN,imdbDisplay,NaN,0
36415454,tt9916702,1,Loving London: The Playground,US,NaN,NaN,NaN,0
36415497,tt9916756,1,Pretty Pretty Black Girl,US,NaN,imdbDisplay,NaN,0
36415513,tt9916764,1,38,US,NaN,imdbDisplay,NaN,0

In [119]:
# Filter the basics table down to only include the US by using the filter akas dataframe
keepers =basics_df['tconst'].isin(akas_df['titleId'])
keepers

34803       True
42384       True
61115       True
67667       True
86799       True
           ...
9970892     True
9970901     True
9970940    False
9970985     True
9971069    False
Name: tconst, Length: 138096, dtype: bool

In [120]:
basics_df = basics_df[keepers]
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34803,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
42384,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History"
61115,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
67667,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
86799,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

### Ratings

In [112]:
ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000003            6.5      1839
3  tt0000004            5.5       178
4  tt0000005            6.2      2624

#### Replace N with NaN

In [113]:
ratings_df.replace({'\\N':np.nan}, inplace=True)

#### Keep only US movies

In [121]:
ratings_us = ratings_df['tconst'].isin(akas_df['titleId'])

In [122]:
ratings_df = ratings_df[ratings_us]
ratings_df

            tconst  averageRating  numVotes
0        tt0000001            5.7      1982
1        tt0000002            5.8       265
4        tt0000005            6.2      2624
5        tt0000006            5.1       182
6        tt0000007            5.4       821
...            ...            ...       ...
1325542  tt9916200            8.1       230
1325543  tt9916204            8.2       264
1325550  tt9916348            8.3        18
1325551  tt9916362            6.4      5391
1325556  tt9916428            3.8        14

[502484 rows x 3 columns]

In [123]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 81829 entries, 34803 to 9970985
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81829 non-null  object
 1   titleType       81829 non-null  object
 2   primaryTitle    81829 non-null  object
 3   originalTitle   81829 non-null  object
 4   isAdult         81829 non-null  object
 5   startYear       81829 non-null  float64
 6   endYear         0 non-null      object
 7   runtimeMinutes  81829 non-null  object
 8   genres          81829 non-null  object
dtypes: float64(1), object(8)
memory usage: 6.2+ MB

In [124]:
akas_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1448457 entries, 5 to 36415513
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1448457 non-null  object
 1   ordering         1448457 non-null  int64
 2   title            1448457 non-null  object
 3   region           1448457 non-null  object
 4   language         3976 non-null     object
 5   types            980750 non-null   object
 6   attributes       46875 non-null    object
 7   isOriginalTitle  1447115 non-null  object
dtypes: int64(1), object(7)
memory usage: 99.5+ MB

In [125]:
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 502484 entries, 0 to 1325556
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         502484 non-null  object
 1   averageRating  502484 non-null  float64
 2   numVotes       502484 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 15.3+ MB

## Create Folder

In [127]:
# example making new folder with os
import os
os.makedirs('Data/',exist_ok=True) 
# Confirm folder created
os.listdir("Data/")

[]

### Save data frames in data folder

In [128]:
basics_df.to_csv('Data/title_basics.csv.gz', compression='gzip', index=False)

In [129]:
ratings_df.to_csv('Data/title_ratings.csv.gz', compression='gzip', index=False)

In [130]:
akas_df.to_csv('Data/title_akas.csv.gz', compression='gzip', index=False)

## Replace Data Frames

In [131]:
basics_df = pd.read_csv('Data/title_basics.csv.gz', low_memory=False)
basics_df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
...,...,...,...,...,...,...,...,...,...
81824,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama
81825,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy"
81826,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama
81827,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller"
81828,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History"

In [132]:
akas_df = pd.read_csv('Data/title_akas.csv.gz', low_memory=False)
akas_df

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0
...,...,...,...,...,...,...,...,...
1448452,tt9916560,1,March of Dimes Presents: Once Upon a Dime,US,NaN,imdbDisplay,NaN,0.0
1448453,tt9916620,1,The Copeland Case,US,NaN,imdbDisplay,NaN,0.0
1448454,tt9916702,1,Loving London: The Playground,US,NaN,NaN,NaN,0.0
1448455,tt9916756,1,Pretty Pretty Black Girl,US,NaN,imdbDisplay,NaN,0.0
1448456,tt9916764,1,38,US,NaN,imdbDisplay,NaN,0.0

In [133]:
ratings_df = pd.read_csv('Data/title_ratings.csv.gz', low_memory=False)
ratings_df

           tconst  averageRating  numVotes
0       tt0000001            5.7      1982
1       tt0000002            5.8       265
2       tt0000005            6.2      2624
3       tt0000006            5.1       182
4       tt0000007            5.4       821
...           ...            ...       ...
502479  tt9916200            8.1       230
502480  tt9916204            8.2       264
502481  tt9916348            8.3        18
502482  tt9916362            6.4      5391
502483  tt9916428            3.8        14

[502484 rows x 3 columns]